Tekla Open API Reference for Tekla Structures 2025
TransformationPlane.TransformationMatrixToLocal Property
 Gives a transformation matrix for converting points in the global plane to local coordinates in the transformation plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Matrix TransformationMatrixToLocal { get; }
Public ReadOnly Property TransformationMatrixToLocal As Matrix
	Get
Property Value
Type: Matrix
See Also
Reference
TransformationPlane Class
Tekla.Structures.Model Namespace